{
    "class_name": "Sequential",
    "config": [
        {
            "class_name": "Conv2D",
            "config": {
                "kernel_size": [
                    3,
                    3
                ],
                "padding": "same",
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "mode": "fan_avg",
                        "distribution": "uniform",
                        "seed": null,
                        "scale": 1.0
                    }
                },
                "use_bias": true,
                "kernel_constraint": null,
                "dtype": "float32",
                "data_format": "channels_last",
                "filters": 64,
                "bias_constraint": null,
                "batch_input_shape": [
                    null,
                    64,
                    64,
                    1
                ],
                "bias_regularizer": null,
                "strides": [
                    1,
                    1
                ],
                "activity_regularizer": null,
                "dilation_rate": [
                    1,
                    1
                ],
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "trainable": true,
                "activation": "relu",
                "name": "conv2d_1"
            }
        },
        {
            "class_name": "MaxPooling2D",
            "config": {
                "pool_size": [
                    2,
                    2
                ],
                "padding": "valid",
                "strides": [
                    2,
                    2
                ],
                "trainable": true,
                "data_format": "channels_last",
                "name": "max_pooling2d_1"
            }
        },
        {
            "class_name": "Conv2D",
            "config": {
                "padding": "same",
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "mode": "fan_avg",
                        "distribution": "uniform",
                        "seed": null,
                        "scale": 1.0
                    }
                },
                "use_bias": true,
                "kernel_constraint": null,
                "data_format": "channels_last",
                "filters": 128,
                "bias_constraint": null,
                "kernel_size": [
                    3,
                    3
                ],
                "bias_regularizer": null,
                "strides": [
                    1,
                    1
                ],
                "activity_regularizer": null,
                "dilation_rate": [
                    1,
                    1
                ],
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "trainable": true,
                "activation": "relu",
                "name": "conv2d_2"
            }
        },
        {
            "class_name": "MaxPooling2D",
            "config": {
                "pool_size": [
                    2,
                    2
                ],
                "padding": "valid",
                "strides": [
                    2,
                    2
                ],
                "trainable": true,
                "data_format": "channels_last",
                "name": "max_pooling2d_2"
            }
        },
        {
            "class_name": "Conv2D",
            "config": {
                "padding": "same",
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "mode": "fan_avg",
                        "distribution": "uniform",
                        "seed": null,
                        "scale": 1.0
                    }
                },
                "use_bias": true,
                "kernel_constraint": null,
                "data_format": "channels_last",
                "filters": 256,
                "bias_constraint": null,
                "kernel_size": [
                    3,
                    3
                ],
                "bias_regularizer": null,
                "strides": [
                    1,
                    1
                ],
                "activity_regularizer": null,
                "dilation_rate": [
                    1,
                    1
                ],
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "trainable": true,
                "activation": "relu",
                "name": "conv2d_3"
            }
        },
        {
            "class_name": "MaxPooling2D",
            "config": {
                "pool_size": [
                    2,
                    2
                ],
                "padding": "valid",
                "strides": [
                    2,
                    2
                ],
                "trainable": true,
                "data_format": "channels_last",
                "name": "max_pooling2d_3"
            }
        },
        {
            "class_name": "Flatten",
            "config": {
                "trainable": true,
                "data_format": "channels_last",
                "name": "flatten_1"
            }
        },
        {
            "class_name": "Dropout",
            "config": {
                "noise_shape": null,
                "trainable": true,
                "seed": null,
                "rate": 0.5,
                "name": "dropout_1"
            }
        },
        {
            "class_name": "Dense",
            "config": {
                "bias_constraint": null,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "mode": "fan_avg",
                        "distribution": "uniform",
                        "seed": null,
                        "scale": 1.0
                    }
                },
                "use_bias": true,
                "kernel_constraint": null,
                "units": 1024,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "trainable": true,
                "activation": "relu",
                "name": "dense_1"
            }
        },
        {
            "class_name": "Dropout",
            "config": {
                "noise_shape": null,
                "trainable": true,
                "seed": null,
                "rate": 0.5,
                "name": "dropout_2"
            }
        },
        {
            "class_name": "Dense",
            "config": {
                "bias_constraint": null,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "mode": "fan_avg",
                        "distribution": "uniform",
                        "seed": null,
                        "scale": 1.0
                    }
                },
                "use_bias": true,
                "kernel_constraint": null,
                "units": 200,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "trainable": true,
                "activation": "softmax",
                "name": "dense_2"
            }
        }
    ],
    "backend": "tensorflow",
    "keras_version": "2.1.6"
}